html/E.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2018-02-27 Tue 09:37 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>附录E 获取以及编译Emacs</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Shuai Zhao" />
<link rel="stylesheet" type="text/css" href="../resource/org.css" />
</head>
<body>
<div id="content">
<h1 class="title">附录E 获取以及编译Emacs</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org72316eb">1. 在本章：</a></li>
<li><a href="#org153836d">2. 获取包</a></li>
<li><a href="#orgea8c958">3. 解包，编译，以及安装Emacs</a>
<ul>
<li><a href="#orgf4c6529">3.1. 解包</a></li>
<li><a href="#orgf202492">3.2. 编译和安装</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org72316eb" class="outline-2">
<h2 id="org72316eb"><span class="section-number-2">1</span> 在本章：</h2>
<div class="outline-text-2" id="text-1">
<p>
<b>获取包</b><br />
<b>解包，编译，以及安装Emacs</b><br />
</p>
</div>
</div>

<div id="outline-container-org153836d" class="outline-2">
<h2 id="org153836d"><span class="section-number-2">2</span> 获取包</h2>
<div class="outline-text-2" id="text-2">
<p>
本书中描述的所有软件包，除了TEX，都是自由软件基金会的GNU软件。它们的软件和其他包都可以通过匿名FTP从ftp.gnu.ai.mit.edu下的/pub/gnu路径获取。有很多镜像网站，相关信息在GNUinfo/FTP下。<br />
</p>

<p>
如果你不能从网上下载到，或者你希望有更简单的方式，你可以从自由软件基金会订购软件的发布版本。它们有磁盘，磁带，以及光盘版本。你还可以订购许多纸质版本的GNU手册，包括一些关于Emacs的，还有<a href="D.html">附录D</a>中提到的Textinfo手册。要知道更多信息，包括价格，可以联系FSF：<br />
</p>
<div class="org-src-container">
<pre class="src src-text">Free Software Foundation, Inc.
59 Temple Place - Suite 330
Boston, MA 02111-1307 USA
Telephone: +1-617-542-5942
Fax: +1-617-542-2652
Email: gnu@prep.ai.mit.ed
</pre>
</div>

<p>
本书中提到的FSF提供的包有：<br />
</p>

<ul class="org-ul">
<li>Emacs<br />
编辑器本身，包括很多Lisp扩展。源文件以emacs-x.y.tar.gz的形式存在，其中x和y分别是最新版本的主版本和小版本号（当前是19.34）。<br /></li>
<li>Textinfo<br />
GNU文档系统，包括makeinfo和一个关于如何编写Textinfo文档的手册。需要TEX来生成可打印的手册。形式为textinfo-x.y.gz。当前版本为3.7。<br /></li>
<li>Emacs Lisp Reference Manual<br />
The Emacs Lisp Reference Manual的Textinfo文档的源文件以elisp-manual-19-x.y.tar.gz的形式存在。（19是Emacs的主版本。）当前手册的版本是2.4。对于Emacs Lisp程序员来说，一个在线版本的手册是不可或缺的。<br /></li>
<li>Shar untilities<br />
包括shar和unshar，用来创建和解包软件发布版本。形式为sharutils-x.y.gz。当前版本是4.2。shar文件不需要使用unshar解包；只需要使用标准的UNIX sh命令就可以了。<br /></li>
<li>Gzip Compression and decompression package<br />
形式为gzip-x.y.shar。当前版本为1.2.4。<br /></li>
<li>Tar &#x2013; 另一个用来创建和解包软件发布版本的程序<br />
形式为tar-x.y.shar.gz。当前版本为1.11.8。注意不像大多数其他的实现，GNU tar可以处理.tar.gz文件而并不需要gzip的存在。<br /></li>
<li>The Jargon File<br />
在线Hacker Jargon File（在前言中引用过）在FSF中也有提供，文件为jargversion.txt.gz，当前版本为400。也有Info格式的版本，jargversion.info.gz。它是黑客知识的宝库，会以书籍的形式The New Hacker's Dictionary定期发布。<br /></li>
</ul>

<p>
你可以通过TEX用户组获取到TEX。<br />
</p>
<div class="org-src-container">
<pre class="src src-text">TEX Users Group
1850 Union Street&#8212;Suite 1637
San Francisco, CA 94123 USA
Home page: http://www.tug.org/
Email: tug@tug.org
Fax: +1-415-982-8559
</pre>
</div>
</div>
</div>

<div id="outline-container-orgea8c958" class="outline-2">
<h2 id="orgea8c958"><span class="section-number-2">3</span> 解包，编译，以及安装Emacs</h2>
<div class="outline-text-2" id="text-3">
<p>
就像大多数GNU软件，Emacs的解包，编译和安装也很简单。实际上，下面的说明对于几乎所有GNU软件包都有效，而不仅仅是Emacs。<br />
</p>
</div>

<div id="outline-container-orgf4c6529" class="outline-3">
<h3 id="orgf4c6529"><span class="section-number-3">3.1</span> 解包</h3>
<div class="outline-text-3" id="text-3-1">
<p>
如果你有一个压缩的tar文件（文件名以.tar.gz，.tar.Z，或者.tgz）并且你拥有GNU tar，执行：<br />
</p>
<div class="org-src-container">
<pre class="src src-shell">tar zxvf file
</pre>
</div>

<p>
如果你没有GNU tar，使用这个：<br />
</p>
<div class="org-src-container">
<pre class="src src-shell">zcat file | tar xvf -
</pre>
</div>

<p>
（你可以在Gzip包中找到zcat。）如果你使用的tar来自于SVR4的衍生版本，你可能需要把xvf替换为xvof。o使你成为展开的文件的拥有者。（否则，拥有者为tar文件的发布者&#x2013;你的电脑可能并不认识他。）<br />
</p>

<p>
如果你有一个shar文件（文件名以.sh或者.shar结尾），执行<br />
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">unshar file
</pre>
</div>
<p>
或者简单的<br />
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">sh file
</pre>
</div>

<p>
如果shar文件本身压缩了（.Z或者.gz），首先用gzip -d解压它。<br />
</p>
</div>
</div>

<div id="outline-container-orgf202492" class="outline-3">
<h3 id="orgf202492"><span class="section-number-3">3.2</span> 编译和安装</h3>
<div class="outline-text-3" id="text-3-2">
<p>
首先在要编译的软件包的顶层目录，通过运行configure脚本来配置软件。<br />
</p>

<p>
不同的软件包拥有不同的配置选项。使用./configure &#x2013;help来查看这个包的选项。Emacs的选项有：<br />
</p>
<ul class="org-ul">
<li>&#x2013;with-gcc<br />
使用GNU C编译器来编译Emacs。<br /></li>
<li>&#x2013;with-pop<br />
编译支持Post Office Protocol（POP），有时用来收取email（对于用Emacs读取邮件的用户）<br /></li>
<li>&#x2013;with-kerberos<br />
对POP使用Kerberos鉴权扩展。<br /></li>
<li>&#x2013;with-hesiod<br />
使用Hesiod寻找POP服务器。<br /></li>
<li>&#x2013;with-x<br />
支持X窗口。<br /></li>
<li>&#x2013;with-x-toolkit<br />
更好的X窗口支持；使用工具箱部件。默认使用Toolkit，但是&#x2013;with-x-toolkit=motif会使用Motif工具箱替代它。<br /></li>
</ul>

<p>
你还可能希望查看configure脚本在执行的时候做了什么&#x2013;这可能会有一会儿&#x2013;所以你还可以使用&#x2013;verbose选项。下面就是我经常执行的configure：<br />
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">./configure --verbose --with-x --with-x-toolkit
</pre>
</div>

<p>
在配置完包之后，执行make。这将会编译程序并且会花相当长的时间。<br />
</p>

<p>
下一步，执行make check。这会执行包里提供的自检程序。<br />
</p>

<p>
假设软件正确编译并且通过了测试，使用make install来安装它。<br />
</p>
</div>
</div>
</div>
</div>
</body>
</html>
